PKS1C/src/Documents/ЗаявкиКлиентов/ЗаявкиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкиКлиентов</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.СтатусыЗаявок</registerRecords>
  <attributes>
    <name>ТемаЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.ТипыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаРешения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаявки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПросрочки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

PKS1C/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Открыта</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДействийКлиента</name>
  </enumValues>
</mdclass:Enum>

PKS1C/src/Documents/ЗаявкиКлиентов/Forms/ФормаВыбора/Module.bsl
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Для Каждого Строка Из Строки Цикл
		Строка.Значение.Данные.Номер = Формат(Число(Строка.Значение.Данные.Номер),"ЧГ="); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Элемент)
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "Программный отбор" Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
	Если Элемент = Элементы.Приоритет1 Тогда
		ПриоритетБул = Истина;
	ИначеЕсли Элемент = Элементы.Статус1 Тогда
		СтатусБул = Истина;
	ИначеЕсли Элемент = Элементы.Клиент1 Тогда
		КлиентБул = Истина;
	ИначеЕсли Элемент = Элементы.МоиЗаявки Тогда
		Если МоиЗаявки Тогда
			СтатусБул = Истина;
			Статус = ПолучитьПеречесление();
		КонецЕсли;
	КонецЕсли;

	
	ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.Использование = Истина;
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Представление = "Программный отбор";
	
	Если ПриоритетБул Тогда
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Приоритет");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Приоритет;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.Представление = "Программный отбор";
	КонецЕсли;
	
	Если СтатусБул Тогда
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Статус;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.Представление = "Программный отбор";
	КонецЕсли;
	
	Если КлиентБул Тогда
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Клиент;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.Представление = "Программный отбор";
	КонецЕсли;
	
	Если МоиЗаявки Тогда
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтветственноеЛицо");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ПолучитьФИО();
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.Представление = "Программный отбор";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("КлиентОтбор") Тогда
		Клиент = Параметры.КлиентОтбор;
		КлиентБул = Истина;
	КонецЕсли;
	Элементы.Список.РежимВыбора = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФИО()
	Возврат ПользователиКлиентСервер.ТекущийПользователь().ФизическоеЛицо;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отбор(ЭтаФорма);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПеречесление()
	Возврат Перечисления.СтатусыЗаявок.Открыта;
КонецФункции
